# class Dogs:
  # def __init__(self,step_num = 2): #Self = sharik (Равно созданной переменной)
    # """__init__(step_num =2)""" #Пояснение к месту куда привязываем """"""
    # self.eats = 10
    # self.__number = 9
    # self.step = step_num #Step - шаг последовательности
  #   print("class dogs") 
  #   print (self.step)
  # def feed(self):
  #  self.eats += 20
  # def num_print(self):
  #   print(self.__number)

# sharik = Dogs(8)
# print(sharik.eats)
# sharik.feed()
# sharik.__number = 0
# sharik.num_print()
# print(sharik.eats)
# dog1 = Dogs()
# print(type(dog1))

#Задание 2
# class TriangleChecker():
#   def __init__(self,num:int):
#     self.num= num
#   def is_triangle(self):
#     if (type(self.num) == str):
#     print("Нужно вводить только числа!")
#     elif (self.num<0):
#     print("С отрицательными числами ничего не выйдет!")
#     elif (self.num==0):
#     print("Жаль, этого треугольник не сделать!")
# sq1 = TriangleChecker
# sq1.is_triangle

